### Imports

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sqlite3

### Fetch data

In [11]:
conn = sqlite3.connect('babar_tables')

sql_customer = pd.read_sql_query('''SELECT * FROM babar_server_customer''', conn)
sql_product = pd.read_sql_query('''SELECT * FROM babar_server_product''', conn)
sql_purchase = pd.read_sql_query('''SELECT * FROM babar_server_purchase''', conn)

In [16]:
df_customer = pd.DataFrame(sql_customer)
df_product = pd.DataFrame(sql_product)
df_purchase = pd.DataFrame(sql_purchase)

In [21]:
df_customer.head(5)

,id,firstname,lastname,nickname,email,status_id,year
0,1,Adrian,Gonzalez Lopez,Gonzy,6154090779@example.org,1,2011
1,2,Adrien,Combourieu,4C6XOE0V,2954840906@example.org,1,2011
2,3,Adrien,Levinger,8ZCMGMUX,2009015135@example.org,1,2011
3,4,Adrien,Durand,1LUKOA9U,0499164407@example.org,1,2011
4,5,Adrien,Clairon,MUJ55X3B,4559527254@example.org,1,2011

In [22]:
df_product.head(5)

   id               name  price
0   1              Leffe    1.8
1   2  Hoegaaden blanche    1.8
2   3         Desperados    2.1
3   4               Soft    1.0
4   5              Clope    0.5

In [23]:
df_purchase.head(5)

   id            timestamp  amount  customer_id  product_id
0   1  2009-04-28 11:47:01     0.3          161           5
1   2  2009-04-28 11:47:01     0.3          161           5
2   3  2009-04-28 11:47:01     0.3          161           5
3   4  2009-04-28 11:47:01     0.6          161           4
4   5  2009-04-28 11:47:01     1.2          161           1